In [2]:
import pandas as pd

a1 = [[1,2,3], [4,5,6], [7,8,9]]
df1 = pd.DataFrame(a1, columns=["A", "B", "C"], index=["가", "나", "다"])

df2 = df1.reindex(columns=["B", "C", "A"], index=["나", "다", "가"]).copy()

sr1 = df1.loc["가"]
df3 = df1.iloc[:2, :2]

df1

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [3]:
df1 * df1

    A   B   C
가   1   4   9
나  16  25  36
다  49  64  81

In [4]:
df2

   B  C  A
나  5  6  4
다  8  9  7
가  2  3  1

In [9]:
df1 + df2

    A   B   C
가   2   4   6
나   8  10  12
다  14  16  18

In [6]:
df3

   A  B
가  1  2
나  4  5

In [7]:
df1 * df3

      A     B   C
가   1.0   4.0 NaN
나  16.0  25.0 NaN
다   NaN   NaN NaN

In [8]:
df1 + df3

     A     B   C
가  2.0   4.0 NaN
나  8.0  10.0 NaN
다  NaN   NaN NaN

In [10]:
df1.add(df3, fill_value=0)

     A     B    C
가  2.0   4.0  3.0
나  8.0  10.0  6.0
다  7.0   8.0  9.0

In [12]:
sr1

A    1
B    2
C    3
Name: 가, dtype: int64

In [11]:
df1 + sr1
# 행 기준으로 브로드캐스팅함

   A   B   C
가  2   4   6
나  5   7   9
다  8  10  12

In [15]:
df1.add(sr1, axis=1)
# axis 기본값은 1, 행 기준

   A   B   C
가  2   4   6
나  5   7   9
다  8  10  12

In [16]:
df1.add(sr1, axis=0)
# axis 0은 열 기준

    A   B   C
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN
가 NaN NaN NaN
나 NaN NaN NaN
다 NaN NaN NaN